{
  "nav": {
    "buttonLanguageTooltip": "English?",
    "sections": {
      "testimonials": {
        "tooltip": "Referenties van vroegere collega's",
        "anchor": "Referenties"
      },
      "myWork": {
        "tooltip": "Waarom ik doe wat ik doe",
        "anchor": "Een verschil maken"
      },
      "skills": {
        "tooltip": "Hoe ik doe wat ik doe",
        "anchor": "Skills"
      },
      "contactForm": {
        "tooltip": "Wat wij samen kunnen bereiken",
        "anchor": "Werk met mij"
      }
    }
  },
  "backToTop": {
    "anchor": "Terug naar boven"
  },
  "home": {
    "titleProgrammer": "Programmeur",
    "titleBusiness": "Zakelijk inzicht",
    "subtitleProgrammer": "Maak het verschil door het bouwen van elegante oplossingen voor complexe problemen.",
    "subtitleBusiness": "Efficiëntie door middel van een hoog analytisch vermogen en de combinatie van technologie en bedrijfsperspectief.",
    "buttonProgrammer": "Lees meer",
    "buttonBusiness": "Lees meer"
  },
  "testimonials": {
    "title": "Ik ben Rob Derks",
    "subtitle": "Programmeur met zakelijk inzicht",
    "guus": {
      "name": "Guus Meijer",
      "role": "Co-founder Yubu",
      "content": "Rob was voor mij de ideale (sparring)partner in mijn tijd als productowner. Hij is een echte allrounder en schakelt moeiteloos tussen concept, UI/UX-design, frontend en backend. Wat Rob uniek maakt is dat hij naast de technische realisatie ook op een abstract niveau conceptueel kan meedenken. Hierbij vergeet hij de eindgebruiker & businessdoelstellingen nooit uit het oog. Daarnaast is Rob een zeer prettig persoon om mee samen te werken en kan hij zich moeiteloos aanpassen aan verschillende werkprocessen."
    },
    "kees": {
      "name": "Kees Meershoek",
      "role": "Co-founder Yubu",
      "content": "Rob heeft als co-founder van Yubu zich in de gehele reis laten gelden: van de eerste klant interviews tot de technische verwerking van grote gebruikersaantallen, van het samenstellen van het MVP tot complexe koppelingen van het platform aan verschillende API's. Dit tekent het uitzonderlijke vermogen van Rob om op meerdere manieren mee te denken: niet alleen als full-stack programmeur maar met de bril van de klant, een accountmanager of het bedrijf als geheel. Deze flexibiliteit was één van de onmisbare sleutels naar het succes van Yubu."
    },
    "alex": {
      "name": "Alex Buis",
      "role": "CTO We Are Builders",
      "content": "Alex moet zijn testimonial nog inleveren."
    }
  },
  "myWork": {
    "title": "Een verschil maken",
    "subtitle": "Daar krijg ik energie van",
    "yubu": {
      "date": "2008 - 2019",
      "title": "SaaS oplossing voor studiekeuze van middelbare scholieren",
      "role": "CTO Yubu",
      "content": "<b>Waarom</b><br>Met Yubu maakten wij het verschil voor middelbare scholieren. Na mijn eigen dramatische studiekeuzeproces, wist ik dat er het een en ander binnen het studiekeuzedomein verbeterd kon worden. Met Yubu hebben we bewezen dat een verbeteringsslag gemaakt kon worden en dat daar ook behoefte naar was.<br><br><b>Hoe</b><br>We zijn begonnen met drie oprichters. Guus Meijer, Kees Meershoek en ikzelf. We begonnen als een kleine start-up en hebben ontzettend veel geleerd van het proces. Op vlakken als 'studiekeuze' of 'dev-ops' (Scrum) hebben we onszelf getraind. Op andere vlakken zoals de schaalbaarheid en robuustheid van onze software hebben we kennis ingekocht. In het laatste geval hebben we een privé couch ingehuurd die mij heeft getraind tot een top-level programmeur. In dit proces zijn we begeleid door `We Are Builders` (een succesvolle start-up studio uit Rotterdam).<br><br><b>Wat</b><br>Bij Yubu was ik verantwoordelijk voor de technische uitvoering, maar had ook de gedeelde verantwoordelijkheid voor de strategische keuzes.<br>Het succes van onze start-up schrijven wij toe aan onze focus op de eindegebruiker (de scholier) in ons ontwerpproces. Wij bouwden software en serious games, afgestemd op hun behoeftes. Scholieren reageerden erg positief op een product wat eindelijk naar hén luisterde in plaats van alleen maar naar de wensen van de decaan.<br>Tijdens onze investeringsrondes en tijdens de verkoop van ons bedrijf heb ik mogen leren van door de wol geverfde investeerders waardoor ik inzicht heb gekregen in business-strategieën van de hoogste plank. Samengevat, binnen de tijd bij Yubu heb ik me ontwikkeld tot de programmeur met zakelijk inzicht die ik nu ben."
    },
    "greenlancers": {
      "date": "2020 - huidige project",
      "title": "Start-up om het groeiende aantal freelancers te faciliteren om een positieve invloed te hebben op de klimaatproblematiek.",
      "role": "Oprichter Greenlancers",
      "content": "<b>Waarom</b><br>Naar mijn mening is de klimaatverandering the grootste uitdaging waar we nu met zijn allen voor staan. Als een ondernemende programmeur kan ik schaalbare concepten bouwen die in potentie veel meer impacht hebben dan de hoeveelheid impact die het aanpassen van mijn eigen gedrag zou hebben. Ik ga de uitdaging aan om mijn steentje bij te dragen aan deze klimaatuitdating.<br><br><b>Hoe</b><br>Greenlancers faciliteert het groeiende aantal freelancers om zich naast en tijdens hun werkzaamheden in te zetten voor een betere wereld. Door te valideren of, en te valideren hoe freelancers bereid zijn om een gedeelte van hun omzet af te staan aan impactvolle klimaatpositieve projecten wereldwijd.<br><br><b>Wat</b><br>Op dit moment is 'Green freelancers' (Greenlancers) concepten aan het valideren. Zodra een schaalbaar model gevalideerd is, wil Greenlancers groeien en zo kapitaal verplaatsen naar klimaat-positieve projecten/bedrijven."
    }
  },
  "skillset": {
    "title": "Maar... maar... hoe dan?",
    "subtitle": "Een kort overzicht van software en technische skills",
    "content": "Ook al is mijn sterkste punt mijn domein-overstijgende ervaring en kennis, vind ik het belangrijk een overzicht te geven van mijn technische skills. Deze lijst is niet compleet, maar is slechts een lijst van mijn favoriete technieken en software. Klik op een skill voor een uitgebreidere beschrijving.",
    "skills": {
      "chrome":  {
        "name": "Chrome",
        "description": "Simply can't live without it. Dev tools is essential for most developers."
      },
      "composer":  {
        "name": "Composer",
        "description": "Simply can't live without it. Composer looks after all of my php-packages for me."
      },
      "css":  {
        "name": "Css",
        "description": "When it comes to CSS I like to write CSS-only components. I find it a challenge to keep things as clean and lightweight as possible."
      },
      "docker":  {
        "name": "Docker",
        "description": "With Docker you can run projects on your local machine almost identical to what you actually host in the web. This way 'it works on my machine so it should work' almost becomes a reasonable thing to say."
      },
      "git":  {
        "name": "Git",
        "description": "In programming it's important to realise the immense amount of work others have done to make possible what we build now. Let us thank Linus Torvalds for creating GIT."
      },
      "github":  {
        "name": "Github",
        "description": "My choice at this moment when it comes down to version control for my personal projects. I love how GitHub works together with the deployment service 'Travis'."
      },
      "html5":  {
        "name": "Html5",
        "description": "Writing readable and understandable code is important, and html5 simplifies that. No reason not to love it."
      },
      "javascript":  {
        "name": "Javascript",
        "description": "The web wouldn't exist without it nowadays. My framework of choice is Vue. Though I also like to explore other frameworks from time to time."
      },
      "laravel":  {
        "name": "Laravel",
        "description": "Simple yet effective back-end framework based on PHP. I have worked with it for 5+ years now and loved every minute of it. "
      },
      "linux":  {
        "name": "Linux",
        "description": "This is my operation system of choice. You can say it's better, or faster, or more flexible... It just comes down to 'more fun' then windows."
      },
      "mysql":  {
        "name": "Mysql",
        "description": "Even though I would never use MySQL in a new project anymore, but plenty existing projects are still run by MySQL. If you consider that you learn from making mistakes... I've learnt basically everything about MySQL."
      },
      "nodejs":  {
        "name": "Nodejs",
        "description": "What is there to say... Can't live without it. Node does the heavy javscript lifting."
      },
      "php":  {
        "name": "Php",
        "description": "You either love this back-end programming language or you hate it. After more then 15 years of getting to know all of it's little quirks and strange behaviours sometimes you can guess which side I am on. My favorite framework is Laravel but I do like to explore other frameworks from time to time."
      },
      "phpstorm":  {
        "name": "Phpstorm",
        "description": "PhpStorm has been my IDE for years and it does not keep many secrets for me."
      },
      "postgresql":  {
        "name": "Postgresql",
        "description": "MySQL used to be my weapon of choice because the strictness that comes with Postgres did not appeal to me at first. Now I would not want anything else."
      },
      "postman":  {
        "name": "Postman",
        "description": "Can not work without Postman when developing and testing API's. It has saved me important hours in the past and will continue to do so."
      },
      "stack":  {
        "name": "Stack",
        "description": "What to say about stack-overflow. Whenever SO is down, I rather go get myself a cup of coffee. Or two..."
      },
      "vue":  {
        "name": "Vue",
        "description": "Vue is a front-end framework that works really well with Laravel. Worked with it most of my time at Yubu which means I have 5+ years of experience with it."
      }
    }
  },
  "contactForm": {
    "title": "Stuur me een bericht",
    "subtitle": "En laten we samen werken aan jouw volgende project...",
    "placeholders": {
      "name": "Naam",
      "phone": "Telefoon",
      "email": "E-mail",
      "comment": "Je bericht"
    },
    "validation": {
      "name": "Ik heet Rob, hoe heet jij?",
      "phone": "Soms is bellen wel zo prettig. Vul a.u.b. je telefoonnummer in.",
      "email": "De mijne is hello@robderks.com. Wat is die van jou?",
      "invalidEmail": "Deze e-mail lijkt niet te kloppen, kijk je hem even na?",
      "comment": "Waar kan ik je mee helpen?",
      "toast": "Los bovenstaande problemen a.u.b. op"
    },
    "fallBackAlert": {
      "title":"Error",
      "message":"Er is iets onverwachts misgegaan. Stuur direct een e-mail naar hello@robderks.com.",
      "confirmText":"Ok"
    },
    "submit": "Verstuur bericht",
    "thanks": {
      "title": "Bedankt voor je bericht. Ik spreek je snel!",
      "subtitle": "@RobDerks",
      "disclaimer": "Met je persoonlijke gegevens wordt secuur omgegaan en zullen met niemand gedeeld worden."
    }
  },
  "footer": {
    "title": "Ik ben Rob Derks",
    "subtitle": "Programmeur met zakelijk inzicht"
  }
}
